In [75]:
# https://www.encyclopedia-titanica.org/titanic-passengers-and-crew/
data_path='../../data/titanic/'
dataFile=data_path + 'titanicdata.htm'
import sys
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [76]:
from bs4 import BeautifulSoup
with open(dataFile,"rb") as f:
    soup = BeautifulSoup(f,"html.parser")

Some characters could not be decoded, and were replaced with REPLACEMENT CHARACTER.

In [77]:
table = soup.find('table')

In [78]:
import pandas as pd
data = pd.read_html(str(table),flavor='bs4')[0]
data.head()

,Name,Age,Class/Dept,Ticket,Joined,Job,Boat [Body],Unnamed: 7
0,"ABī-AL-MUNà, Mr Nāsīf Qāsim",27,3rd Class Passenger,2699£18 15s 9d,Cherbourg,NaN,15,NaN
1,"ABBING, Mr Anthony",42,3rd Class Passenger,5547£7 11s,Southampton,Blacksmith,NaN,NaN
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,CA2673£20 5s,Southampton,NaN,A,NaN
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,CA2673£20 5s,Southampton,Jeweller,[190],NaN
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,CA2673£20 5s,Southampton,Scholar,NaN,NaN

In [79]:
data = data[["Name","Age","Class/Dept","Boat [Body]"]]

In [80]:
data['Boat [Body]'] = data['Boat [Body]'].replace(np.nan, '', regex = True)
data.head()

                            Name Age           Class/Dept Boat [Body]
0    ABī-AL-MUNà, Mr Nāsīf Qāsim  27  3rd Class Passenger          15
1             ABBING, Mr Anthony  42  3rd Class Passenger
2  ABBOTT, Mrs Rhoda Mary 'Rosa'  39  3rd Class Passenger           A
3     ABBOTT, Mr Rossmore Edward  16  3rd Class Passenger       [190]
4       ABBOTT, Mr Eugene Joseph  13  3rd Class Passenger

In [81]:
def cleanup(value):
    try:
        #print(value)
        return value.encode('ascii', errors='replace').decode('utf-8').replace("?"," ")
    except Exception as e:
        print(e.args)
        print(value)
        sys.exit()

In [82]:
data['Name']= data['Name'].apply(cleanup)
data['Boat [Body]']= data['Boat [Body]'].apply(cleanup)
data.head()

                            Name Age           Class/Dept Boat [Body]
0    AB -AL-MUN , Mr N s f Q sim  27  3rd Class Passenger          15
1             ABBING, Mr Anthony  42  3rd Class Passenger
2  ABBOTT, Mrs Rhoda Mary 'Rosa'  39  3rd Class Passenger           A
3     ABBOTT, Mr Rossmore Edward  16  3rd Class Passenger       [190]
4       ABBOTT, Mr Eugene Joseph  13  3rd Class Passenger

In [83]:
def checkPass(class_type):
    if "Passenger" in class_type:
        return "Passenger"
    else:
        return "Crew"
    
data["Crew/Pass"]=data["Class/Dept"].apply(checkPass)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger

In [84]:
def checkClass(class_type):
    if "Passenger" in class_type:
        return class_type.split(" ")[0]
    else:
        return "Crew"
    
data["Class"]=data["Class/Dept"].apply(checkClass)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger,3rd
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger,3rd
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger,3rd
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger,3rd
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger,3rd

In [85]:
data["Age"][data.Age == '11m'] = 1

In [86]:
def checkAdult(age):
    if float(age) >=18:
        return "Adult"
    else:
        return "Child"
    
data["Adult/Child"]=data["Age"].apply(checkAdult)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger,3rd,Adult
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger,3rd,Adult
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger,3rd,Adult
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger,3rd,Child
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger,3rd,Child

In [87]:
def checkGender(name):
    firstname = name[name.index(",")+2:]
    salutation = firstname.split(" ")[0]
    if salutation in ["Mr","Master"]:
        return "Male"
    else:
        return "Female"

In [88]:
data["Gender"]=data["Name"].apply(checkGender)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger,3rd,Adult,Male
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger,3rd,Adult,Male
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger,3rd,Adult,Female
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger,3rd,Child,Male
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger,3rd,Child,Male

In [89]:
def checkSurvival(boat):
    if boat.strip()=="" or "[" in boat:
        return 0
    else:
        return 1
data["Survival"]=data["Boat [Body]"].apply(checkSurvival)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender,Survival
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger,3rd,Adult,Male,1
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger,3rd,Adult,Male,0
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger,3rd,Adult,Female,1
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger,3rd,Child,Male,0
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger,3rd,Child,Male,0

In [90]:
data.groupby(['Crew/Pass'])['Survival'].sum()*100/data.groupby(['Crew/Pass'])['Survival'].count()

Crew/Pass
Crew         13.586957
Passenger    35.798817
Name: Survival, dtype: float64

In [91]:
def compare(group,data):
    return data.groupby([group])['Survival'].sum()*100/data.groupby([group])['Survival'].count()

compare("Class",data)

Class
1st     57.428571
2nd     37.883959
3rd     24.259520
Crew    13.586957
Name: Survival, dtype: float64

In [92]:
compare("Gender",data)

Gender
Female    59.272097
Male      15.540181
Name: Survival, dtype: float64

In [93]:
compare("Adult/Child",data)

Adult/Child
Adult    25.078370
Child    33.183857
Name: Survival, dtype: float64

In [94]:
trainingData=data[["Age","Crew/Pass","Class","Adult/Child","Gender","Survival"]]
trainingData.head()

  Age  Crew/Pass Class Adult/Child  Gender  Survival
0  27  Passenger   3rd       Adult    Male         1
1  42  Passenger   3rd       Adult    Male         0
2  39  Passenger   3rd       Adult  Female         1
3  16  Passenger   3rd       Child    Male         0
4  13  Passenger   3rd       Child    Male         0

In [95]:
def catToNum(series):
    series = series.astype('category')
    return series.cat.codes

catData=trainingData[["Crew/Pass","Class","Adult/Child","Gender"]].apply(catToNum)
trainingData[["Crew/Pass","Class","Adult/Child","Gender"]]=catData
trainingData.head()

  Age  Crew/Pass  Class  Adult/Child  Gender  Survival
0  27          1      2            0       1         1
1  42          1      2            0       1         0
2  39          1      2            0       0         1
3  16          1      2            1       1         0
4  13          1      2            1       1         0

In [96]:
trainingData['Age'] = trainingData['Age'].apply(pd.to_numeric, errors='coerce')

In [97]:
len(trainingData)

2456

In [98]:
trainingData = trainingData.dropna()
len(trainingData)

2427

In [99]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(trainingData, test_size = 0.2)

In [100]:
train.head()

       Age  Crew/Pass  Class  Adult/Child  Gender  Survival
538   35.0          0      3            0       1         0
2351  30.0          0      3            0       1         1
2091  18.0          1      0            0       0         1
844   31.0          1      2            0       0         1
804   39.0          1      1            0       0         1

In [101]:
test.head()

       Age  Crew/Pass  Class  Adult/Child  Gender  Survival
1202  43.0          0      3            0       1         0
651   28.0          1      2            0       0         0
1809  33.0          0      3            0       0         0
653   33.0          1      2            0       1         0
182   35.0          1      1            0       0         1

In [102]:
len(train)

1941

In [103]:
len(test)

486

In [104]:
from sklearn.tree import DecisionTreeClassifier
clf=DecisionTreeClassifier(max_leaf_nodes=25)
clf=clf.fit(train[["Age","Crew/Pass","Class","Adult/Child","Gender"]],train["Survival"])

In [105]:
clf

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=25,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [106]:
clf.feature_importances_

array([0.18454665, 0.        , 0.25808627, 0.        , 0.55736708])

In [107]:
from sklearn import tree
with open("titanic.dot","w") as f:
    f = tree.export_graphviz(clf,
                            feature_names=["Age","Crew/Pass","Class","Adult/Child","Gender"],out_file=f)

In [108]:
predictions = clf.predict(test[["Age","Crew/Pass","Class","Adult/Child","Gender"]])

In [109]:
from sklearn.metrics import accuracy_score
accuracy_score(test["Survival"], predictions)

0.8065843621399177

In [110]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier(n_estimators=1000,)

In [111]:
clf

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=1000, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [112]:
def checkAccuracy(clf):
    clf=clf.fit(train[["Age","Crew/Pass","Class","Adult/Child","Gender"]],train["Survival"])
    predictions = clf.predict(test[["Age","Crew/Pass","Class","Adult/Child","Gender"]])
    return accuracy_score(test["Survival"], predictions)

In [113]:
checkAccuracy(clf)

0.7880658436213992

In [114]:
from xgboost.sklearn import XGBClassifier

In [115]:
clf = XGBClassifier(n_estimators=1000)

In [116]:
checkAccuracy(clf)

0.8004115226337448

In [117]:
clf

XGBClassifier(base_score=0.5, colsample_bylevel=1, colsample_bytree=1,
       gamma=0, learning_rate=0.1, max_delta_step=0, max_depth=3,
       min_child_weight=1, missing=None, n_estimators=1000, nthread=-1,
       objective='binary:logistic', reg_alpha=0, reg_lambda=1,
       scale_pos_weight=1, seed=0, silent=True, subsample=1)

In [118]:
from hyperopt import fmin, tpe, hp, STATUS_OK,Trials

In [119]:
space ={
    'n_estimators':hp.quniform('n_estimators',100,1000,1),
    'learning_rate':hp.quniform('learning_rate',0.025,0.5,0.025),
    'max_depth':hp.choice('max_depth', np.arange(1, 13, dtype = int)),
    'min_child_weight': hp.quniform('min_child_weight',1,6,1),
    'subsample': hp.quniform('subsample',0.5,1,0.05),
    'gamma':hp.quniform('gamma',0.5,1,0.05),
    'colsample_bytree':hp.quniform('colsample_bytree',0.5,1,0.05),
    'nthread':6,
    'silent':1
}

In [120]:
def score(params):
    params['n_estimators']=int(params['n_estimators'])
    clf=XGBClassifier(**params)
    return {'loss':1-checkAccuracy(clf),'status':STATUS_OK}

In [121]:
trials=Trials()

In [122]:
best=fmin(score,space,algo=tpe.suggest,trials=trials,max_evals=250)

In [123]:
print(best)

{'colsample_bytree': 0.5, 'gamma': 0.65, 'learning_rate': 0.375, 'max_depth': 11, 'min_child_weight': 6.0, 'n_estimators': 111.0, 'subsample': 0.65}

In [124]:
1-score(best)['loss']

0.8189300411522634